Documents/бит_бу_УстановкаБиллинговыхУслугНаЛС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>бит_бу_УстановкаБиллинговыхУслугНаЛС</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.бит_бу_СведенияОБиллинговыхУслугах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_бу_ВидыОперацийУстановкаИзменениеБиллинговыхУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокЛицевыхСчетов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Улица</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокУлиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_бу_БиллинговыеУслуги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЛицевыеСчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КоличествоЕдиницПотребления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поставщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ПоставщикиУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РежимПотребления</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_РежимыПотребленияУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_бу_БиллинговыеУслуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/бит_бу_СведенияОБиллинговыхУслугах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_бу_СведенияОБиллинговыхУслугах</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РежимПотребления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_РежимыПотребленияУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПоставщикиУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоЕдиницПотребления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Использовать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_бу_БиллинговыеУслуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/бит_бу_НачисленияБиллинговыхУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>бит_бу_НачисленияБиллинговыхУслуг</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_бу_БиллинговыеУслуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/бит_бу_ВидыОперацийУстановкаИзменениеБиллинговыхУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>бит_бу_ВидыОперацийУстановкаИзменениеБиллинговыхУслуг</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НазначениеУслугНаЛицевойСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НазначениеУслугиНаЛицевыеСчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтключениеУслугНаЛицевомСчете</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтключениеУслугиНаЛицевыхСчетах</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/бит_бу_УстановкаБиллинговыхУслугНаЛС/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбеспечениеПроведенияДокумента

// Процедура формирует структуру шапки документа и дополнительных полей.
//
Процедура ПодготовитьСтруктуруШапкиДокумента(Заголовок, СтруктураШапкиДокумента, Отказ) Экспорт
	
	СтруктураШапкиДокумента = бит_ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
КонецПроцедуры

// Проверяет правильность заполнения шапки документа.
// Если какой-то из реквизтов шапки, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверяется также правильность заполнения реквизитов ссылочных полей документа.
// Проверка выполняется по объекту и по выборке из результата запроса по шапке.
//
// Параметры: 
//  СтруктураШапкиДокумента - выборка из результата запроса по шапке документа,
//  Отказ                   - флаг отказа в проведении,
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок)
	
	// Укажем, что надо проверить:
	СтруктураОбязательныхПолей = Новый Структура;
	СтруктураОбязательныхПолей.Вставить("Организация");
	
	// Теперь вызовем общую процедуру проверки.
	бит_ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);
	
КонецПроцедуры // ПроверитьЗаполнениеШапки()

// Процедура выполняет движения по регистрам.
//
// Параметры:
//  СтруктураШапкиДокумента - Структура.
//  СтруктураТаблиц 		- Структура.
//  Отказ 					- Булево.
//  Заголовок 				- Строка.
//
Процедура ДвиженияПоРегистрам(СтруктураШапкиДокумента, СтруктураТаблиц, Отказ, Заголовок)
	
	НаборЗаписейСведенияПоУслугам = Движения.бит_бу_СведенияОБиллинговыхУслугах;
	// БИТ_ЖКХ 
	// Удален закоментированый участок кода.
	
	НазначениеУслугиНаЛицевыеСчета = ВидОперации = Перечисления.бит_бу_ВидыОперацийУстановкаИзменениеБиллинговыхУслуг.НазначениеУслугиНаЛицевыеСчета;
	НазначениеУслугНаЛицевойСчет   = ВидОперации = Перечисления.бит_бу_ВидыОперацийУстановкаИзменениеБиллинговыхУслуг.НазначениеУслугНаЛицевойСчет;
	
	Использование = Ложь;
	
	Если НазначениеУслугиНаЛицевыеСчета ИЛИ НазначениеУслугНаЛицевойСчет Тогда
		
		Использование = Истина;
		
	КонецЕсли; 
	
	Для Каждого ТекСтрока Из СтруктураТаблиц Цикл              
		
		СтрокаДвижений                             = НаборЗаписейСведенияПоУслугам.Добавить();
		СтрокаДвижений.Период                      = СтруктураШапкиДокумента.Дата;
		СтрокаДвижений.Организация                 = СтруктураШапкиДокумента.Организация;
		СтрокаДвижений.ЛицевойСчет                 = ТекСтрока.ЛицевойСчет;
		СтрокаДвижений.Услуга                      = ТекСтрока.Услуга;
		СтрокаДвижений.РежимПотребления            = ТекСтрока.РежимПотребления;
		СтрокаДвижений.Поставщик                   = ТекСтрока.Поставщик;
		СтрокаДвижений.Использовать                = Использование;
		СтрокаДвижений.КоличествоЕдиницПотребления = ТекСтрока.КоличествоЕдиницПотребления;
		
	КонецЦикла;
	
КонецПроцедуры // ДвиженияПоРегистрам()

// Функция готовит таблицы документа для проведения.
//
// Параметры:
//  СтруктураШапкиДокумента - Структура.
//
// Возвращаемое значение:
//  СтруктураТаблиц - Структура.
//
Функция ПодготовитьТаблицыДокумента(СтруктураШапкиДокумента)  Экспорт
	
	СтруктураПолей = Новый Структура;
	СтруктураПолей.Вставить("РежимПотребления", "РежимПотребления");
	СтруктураПолей.Вставить("Поставщик"       , "Поставщик");
	
	Если ВидОперации = Перечисления.бит_бу_ВидыОперацийУстановкаИзменениеБиллинговыхУслуг.НазначениеУслугиНаЛицевыеСчета
		ИЛИ ВидОперации = Перечисления.бит_бу_ВидыОперацийУстановкаИзменениеБиллинговыхУслуг.ОтключениеУслугиНаЛицевыхСчетах Тогда
		СтруктураПолей.Вставить("Услуга"           , "Ссылка.Услуга");
		СтруктураПолей.Вставить("ЛицевойСчет"      , "ЛицевойСчет");
	Иначе
		СтруктураПолей.Вставить("Услуга"           , "Услуга");
		СтруктураПолей.Вставить("ЛицевойСчет"      , "Ссылка.ЛицевойСчет");
	КонецЕсли;
	
	СтруктураПолей.Вставить("КоличествоЕдиницПотребления", "КоличествоЕдиницПотребления");
	
	РезультатЗапросаПоУслугам = бит_ОбщегоНазначения.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "ЛицевыеСчета", СтруктураПолей);
	
	// Подготовим таблицы услуг для проведения.
	ТаблицаЛицевыеСчета = РезультатЗапросаПоУслугам.Выгрузить();
	
	Возврат ТаблицаЛицевыеСчета;
	
КонецФункции // ПодготовитьТаблицыДокумента()

Процедура ПроверитьОтключениеУслуг(Отказ)
	
	Если ВидОперации = Перечисления.бит_бу_ВидыОперацийУстановкаИзменениеБиллинговыхУслуг.НазначениеУслугиНаЛицевыеСчета
		ИЛИ ВидОперации = Перечисления.бит_бу_ВидыОперацийУстановкаИзменениеБиллинговыхУслуг.НазначениеУслугНаЛицевойСчет Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("КонецПерода", КонецМесяца(Дата));
	Запрос.УстановитьПараметр("Ссылка"     , Ссылка);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Если ВидОперации = Перечисления.бит_бу_ВидыОперацийУстановкаИзменениеБиллинговыхУслуг.ОтключениеУслугиНаЛицевыхСчетах Тогда
		ПолеУслуги = "Ссылка.Услуга";
		ПолеЛС     = "ЛицевойСчет";
	Иначе
		ПолеУслуги = "Услуга";
		ПолеЛС     = "Ссылка.ЛицевойСчет";
	КонецЕсли; 
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_бу_УстановкаБиллинговыхУслугНаЛСЛицевыеСчета."+ПолеЛС+" КАК ЛицевойСчет,
	|	бит_бу_УстановкаБиллинговыхУслугНаЛСЛицевыеСчета."+ПолеУслуги+" КАК Услуга
	|ПОМЕСТИТЬ ТаблицаДокумента
	|ИЗ
	|	Документ.бит_бу_УстановкаБиллинговыхУслугНаЛС.ЛицевыеСчета КАК бит_бу_УстановкаБиллинговыхУслугНаЛСЛицевыеСчета
	|ГДЕ
	|	бит_бу_УстановкаБиллинговыхУслугНаЛСЛицевыеСчета.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокумента.ЛицевойСчет,
	|	ТаблицаДокумента.Услуга КАК Услуга,
	|	СУММА(ЕСТЬNULL(бит_бу_НачисленияБиллинговыхУслугОстатки.СуммаОстаток, 0)) КАК СуммаОстаток
	|ИЗ
	|	ТаблицаДокумента КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.бит_бу_НачисленияБиллинговыхУслуг.Остатки(&КонецПерода, Организация = &Организация) КАК бит_бу_НачисленияБиллинговыхУслугОстатки
	|		ПО ТаблицаДокумента.ЛицевойСчет = бит_бу_НачисленияБиллинговыхУслугОстатки.ЛицевойСчет
	|			И ТаблицаДокумента.Услуга = бит_бу_НачисленияБиллинговыхУслугОстатки.Услуга
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.ЛицевойСчет,
	|	ТаблицаДокумента.Услуга
	|ИТОГИ
	|	СУММА(СуммаОстаток)
	|ПО
	|	Услуга";
	
	Результат = Запрос.Выполнить();
	Выборка   = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	СписокУслуг = "";
	Пока Выборка.Следующий() Цикл
		
		Если НЕ Выборка.СуммаОстаток = 0 Тогда
			
			СписокУслуг = СписокУслуг + ?(СписокУслуг = "", "",", ") + Выборка.Услуга;
			Отказ = Истина;
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	Если Отказ Тогда
		
		// БИТ_ЖКХ 03.03.2015{{
		// Сообщить("По услугам: "+ СписокУслуг + "
		// |остатки не равны нулю. Отключение невозможно!", СтатусСообщения.ОченьВажное);
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "По услугам: "+ СписокУслуг + "
		|остатки не равны нулю. Отключение невозможно!";
		Сообщение.Сообщить();
		// БИТ_ЖКХ 03.03.2015}}
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытий

// Процедура - обработчик события "ОбработкаПроведения".
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Перем СтруктураШапкиДокумента;
	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = бит_ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
	
	// Подготовим структуру шапки документа.
	ПодготовитьСтруктуруШапкиДокумента(Заголовок, СтруктураШапкиДокумента, Отказ);
	
	// Проверим правильность заполнения шапки документа.
	ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок);
	
	СтруктураТаблиц = ПодготовитьТаблицыДокумента(СтруктураШапкиДокумента);
	
	ПроверитьОтключениеУслуг(Отказ);
	
	Если Не Отказ Тогда
		ДвиженияПоРегистрам(СтруктураШапкиДокумента, СтруктураТаблиц, Отказ, Заголовок);
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события "ОбработкаУдаленияПроведения".
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	бит_ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ, РучнаяКорректировка, Ложь);
	
КонецПроцедуры

// Процедура - обработчик события "ПередЗаписью".
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	СписокЛицевыхСчетов = "";
	
	Если ВидОперации = Перечисления.бит_бу_ВидыОперацийУстановкаИзменениеБиллинговыхУслуг.НазначениеУслугНаЛицевойСчет
		ИЛИ ВидОперации = Перечисления.бит_бу_ВидыОперацийУстановкаИзменениеБиллинговыхУслуг.ОтключениеУслугНаЛицевомСчете Тогда
		
		СписокЛицевыхСчетов = СписокЛицевыхСчетов + ЛицевойСчет.Наименование;
		
	Иначе
		
		ТЗСписокЛС = ЛицевыеСчета.Выгрузить(,"ЛицевойСчет");
		ТЗСписокЛС.Свернуть("ЛицевойСчет");
		
		Для каждого Строка Из ТЗСписокЛС Цикл
			
			Если ПустаяСтрока(Строка.ЛицевойСчет.Наименование) Тогда
				Продолжить;
			КонецЕсли; 
			
			Если СписокЛицевыхСчетов = "" Тогда
				СписокЛицевыхСчетов = ""+Строка.ЛицевойСчет.Наименование;
			Иначе
				СписокЛицевыхСчетов = ""+СписокЛицевыхСчетов +", " +Строка.ЛицевойСчет.Наименование;
			КонецЕсли; 
			
		КонецЦикла;
		
	КонецЕсли; 
	
	
КонецПроцедуры

// Процедура - обработчик события "ПередЗаписью".
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	бит_ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ЭтотОбъект ,бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь"));
	
КонецПроцедуры

// Процедура - обработчик события "ОбработкаПроверкиЗаполнения".
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ВидОперации = Перечисления.бит_бу_ВидыОперацийУстановкаИзменениеБиллинговыхУслуг.НазначениеУслугНаЛицевойСчет
		ИЛИ ВидОперации = Перечисления.бит_бу_ВидыОперацийУстановкаИзменениеБиллинговыхУслуг.ОтключениеУслугНаЛицевомСчете Тогда
		
		ПроверкаБиллинговаяУслуга  =  ПроверяемыеРеквизиты.Найти("Услуга");
		ПроверяемыеРеквизиты.Удалить(ПроверкаБиллинговаяУслуга);
		
		ПроверкаТаблицаЛицевойСчет =  ПроверяемыеРеквизиты.Найти("ЛицевыеСчета.ЛицевойСчет");
		ПроверяемыеРеквизиты.Удалить(ПроверкаТаблицаЛицевойСчет);
		
	Иначе
		
		ПроверкаЛицевойСчет              =  ПроверяемыеРеквизиты.Найти("ЛицевойСчет");
		ПроверяемыеРеквизиты.Удалить(ПроверкаЛицевойСчет);
		
		ПроверкаТаблицаБиллинговаяУслуга =  ПроверяемыеРеквизиты.Найти("ЛицевыеСчета.Услуга");
		ПроверяемыеРеквизиты.Удалить(ПроверкаТаблицаБиллинговаяУслуга);
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
